///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2022, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Определяет список справочников, доступных для загрузки с помощью подсистемы "Загрузка данных из файла".
//
// Параметры:
//  ЗагружаемыеСправочники - ТаблицаЗначений - список справочников, в которые возможна загрузка данных:
//      * ПолноеИмя          - Строка - полное имя справочника (как в метаданных).
//      * Представление      - Строка - представление справочника в списке выбора.
//      * ПрикладнаяЗагрузка - Булево - если Истина, значит справочник использует собственный алгоритм загрузки и
//                                      в модуле менеджера справочника определены функции.
//
Процедура ПриОпределенииСправочниковДляЗагрузкиДанных(ЗагружаемыеСправочники) Экспорт
	
	// {УАТ}
	Если Метаданные.Справочники.Найти("уатТС") <> Неопределено Тогда 
		СтрокаТаблицы = ЗагружаемыеСправочники.Найти(Метаданные.Справочники.уатТС.ПолноеИмя(), "ПолноеИмя");
		Если СтрокаТаблицы = Неопределено Тогда
			Сведения = ЗагружаемыеСправочники.Добавить();
			Сведения.ПолноеИмя     = Метаданные.Справочники.уатТС.ПолноеИмя();
			Сведения.Представление = Метаданные.Справочники.уатТС.Представление();
		КонецЕсли;
	КонецЕсли;
	
	Если Метаданные.Справочники.Найти("Контрагенты") <> Неопределено Тогда 
		СтрокаТаблицы = ЗагружаемыеСправочники.Найти(Метаданные.Справочники.Контрагенты.ПолноеИмя(), "ПолноеИмя");
		Если СтрокаТаблицы = Неопределено Тогда
			Сведения = ЗагружаемыеСправочники.Добавить();
			Сведения.ПолноеИмя     = Метаданные.Справочники.Контрагенты.ПолноеИмя();
			Сведения.Представление = Метаданные.Справочники.Контрагенты.Представление();
		КонецЕсли;
	КонецЕсли;
	
	Если Метаданные.Справочники.Найти("БанковскиеСчета") <> Неопределено Тогда 
		СтрокаТаблицы = ЗагружаемыеСправочники.Найти(Метаданные.Справочники.БанковскиеСчета.ПолноеИмя(), "ПолноеИмя");
		Если СтрокаТаблицы = Неопределено Тогда
			Сведения = ЗагружаемыеСправочники.Добавить();
			Сведения.ПолноеИмя     = Метаданные.Справочники.БанковскиеСчета.ПолноеИмя();
			Сведения.Представление = Метаданные.Справочники.БанковскиеСчета.Представление();
		КонецЕсли;
	КонецЕсли;
	
	Если Метаданные.Справочники.Найти("уатГрузовыеМеста_уэ") <> Неопределено Тогда 
		СтрокаТаблицы = ЗагружаемыеСправочники.Найти(Метаданные.Справочники.уатГрузовыеМеста_уэ.ПолноеИмя(), "ПолноеИмя");
		Если СтрокаТаблицы = Неопределено Тогда
			Сведения = ЗагружаемыеСправочники.Добавить();
			Сведения.ПолноеИмя     = Метаданные.Справочники.уатГрузовыеМеста_уэ.ПолноеИмя();
			Сведения.Представление = Метаданные.Справочники.уатГрузовыеМеста_уэ.Представление();
		КонецЕсли;
	КонецЕсли;
	// {/УАТ}
	
КонецПроцедуры

#КонецОбласти