 
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	HTML = "https://passport.yandex.ru/auth?mode=edit";
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ИдентификаторПриложенияПриИзменении(Элемент)
	Элементы.HTML.Документ.cookie = "";
	Если ЗначениеЗаполнено(ИдентификаторПриложения) Тогда
		HTML = "https://oauth.yandex.ru/authorize?response_type=token&client_id=" + ИдентификаторПриложения; 
	Иначе
		HTML = "https://passport.yandex.ru/auth?mode=edit";
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура УстановитьТокен(Команда)
	
	Токен = "";
	
	Попытка
		Поз = Найти(Элементы.HTML.Документ.URLUnencoded, "access_token=");
		Если Поз <> 0 Тогда 
			Токен = Прав(Элементы.HTML.Документ.URLUnencoded, СтрДлина(Элементы.HTML.Документ.URLUnencoded)-Поз-12);
			Поз = Найти(Токен, "&");
			Если Поз <> 0 Тогда 
				Токен = Лев(Токен, Поз-1);
			КонецЕсли;
		Иначе
			Поз = Найти(Элементы.HTML.Документ.URL, "access_token=");
			Если Поз <> 0 Тогда 
				Токен = Прав(Элементы.HTML.Документ.URL, СтрДлина(Элементы.HTML.Документ.URL)-Поз-12);
				Поз = Найти(Токен, "&");
				Если Поз <> 0 Тогда 
					Токен = Лев(Токен, Поз-1);
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	Исключение
	КонецПопытки;
	
	Если Токен = "" Тогда 
		ТекстОшибки = НСтр("ru='Для получения OAuth-токена авторизуйтесь и заполните реквизит ClientID.'");
		ПоказатьПредупреждение(, ТекстОшибки);
		Возврат;
	КонецЕсли;
	
	Закрыть(Токен);
	
КонецПроцедуры

#КонецОбласти
