
#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если ЭтоГруппа Тогда
		Возврат;
	КонецЕсли;
	
	Если СохранятьОтчетВКаталог тогда
		ПроверяемыеРеквизиты.Добавить("КаталогФайлаДанных");
	КонецЕсли;
	
	Если ВнешняяСистема = Справочники.уатВнешниеСистемы.Газпромнефть Тогда
		ПроверяемыеРеквизиты.Добавить("КлючАвторизации");
		ПроверяемыеРеквизиты.Добавить("Пароль");
	ИначеЕсли ВнешняяСистема = Справочники.уатВнешниеСистемы.ППР Тогда
		ПроверяемыеРеквизиты.Добавить("КлючАвторизации");
	ИначеЕсли ВнешняяСистема = Справочники.уатВнешниеСистемы.ЛукойлЛИКАРД Тогда
		Если ЗначениеЗаполнено(SSLСертификат.Получить()) Тогда
			ПроверяемыеРеквизиты.Добавить("Пароль");
			ПроверяемыеРеквизиты.Добавить("IDКонтракта");
		КонецЕсли;
	ИначеЕсли ВнешняяСистема = Справочники.уатВнешниеСистемы.Роснефть Тогда
		ПроверяемыеРеквизиты.Добавить("Пароль");
		ПроверяемыеРеквизиты.Добавить("IDКонтракта");
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти


