&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	                                                           
	ОбменСГИСЭПД.ПриСозданииНаСервереПодчиненнойФормы(ЭтотОбъект, Отказ, СтандартнаяОбработка);
	
	Если ЗначениеЗаполнено(ЭтотОбъект.Организация) И ЗначениеЗаполнено(МедорганизацияНаименование) = Ложь Тогда
		МедорганизацияНаименование = ЭтотОбъект.Организация.НаименованиеПолное;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ФамилияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	ВыбратьМедработника();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьМедработника()
	
	ПараметрыВыбора = Новый Структура;
	ПараметрыВыбора.Вставить("РежимВыбора",Истина);

	ОбработкаВыбора = Новый ОписаниеОповещения("ВыбратьМедработника_Завершение", ЭтотОбъект, );

	ОткрытьФорму("Справочник.ФизическиеЛица.ФормаВыбора", ПараметрыВыбора,
	        ЭтотОбъект, , , , ОбработкаВыбора);
	        
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьМедработника_Завершение(Значение, ТекущаяСтрока) Экспорт
	
	Если Значение <> Неопределено Тогда  
		РеквизитыКонтрагента = РеквизитыФизЛица(Значение);
		Фамилия = РеквизитыКонтрагента.Фамилия;
		Имя = РеквизитыКонтрагента.Имя;
		Отчество = РеквизитыКонтрагента.Отчество;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция РеквизитыФизЛица(Контрагент)
	// {УАТ}
	Если ТипЗнч(Контрагент) = Тип("СправочникСсылка.ФизическиеЛица") Тогда  
		ФИОВодителя = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Контрагент, "ФИО");
		Возврат ФизическиеЛицаКлиентСервер.ЧастиИмени(ФИОВодителя);
	Иначе
		Возврат ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Контрагент, "Фамилия, Имя, Отчество");
	КонецЕсли;
	// {/УАТ}
КонецФункции


&НаКлиенте
Процедура Сохранить(Команда)
		
	ОбменСГИСЭПДКлиент.СохранитьПараметрыПодчиненнойФормы(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОбменСГИСЭПДКлиент.ПриОткрытииПодчиненнойФормы(ЭтотОбъект);
																		
КонецПроцедуры
			
&НаКлиенте
Функция ОписаниеРеквизитовФормы() Экспорт
	
	Возврат ОписаниеРеквизитовФормыСервер();
	
КонецФункции

&НаСервере
Функция ОписаниеРеквизитовФормыСервер()
	
	Возврат ОбменСГИСЭПД.ОписаниеРеквизитовФормы(ЭтаФорма);
		
КонецФункции

//@skip-check module-unused-method
&НаКлиенте
Процедура Подключаемый_ДобавлениеПоляВвода(Команда)
	
	ИмяТаблицыИПоля = СтрЗаменить(Команда.Имя, "ДобавлениеПоляВвода", "");
	МассивЧастей = ОбменСГИСЭПДКлиентСервер.РазделитьСтрокуСоСложнымРазделителем(ИмяТаблицыИПоля, "__");
	
	ДобавлениеПоляВводаСервер(МассивЧастей[0], МассивЧастей[1]);
	
КонецПроцедуры

&НаСервере
Процедура ДобавлениеПоляВводаСервер(ИмяТаблицы, ИмяПоля)
	
	ОбменСГИСЭПД.СоздатьЭлементыВводаЗначенийСписка(ЭтотОбъект, ИмяТаблицы, ИмяПоля, Истина);
	
КонецПроцедуры

//@skip-check module-unused-method
&НаКлиенте
Процедура Подключаемый_ПолеЗначенияСпискаИзменениеТекстаРедактирования(Элемент, Текст, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;	
	МассивЧастей = ОбменСГИСЭПДКлиентСервер.РазделитьСтрокуСоСложнымРазделителем(Элемент.Имя, "__");	
	УстановитьФорматированноеЗначениеПоляВвода(МассивЧастей[0], МассивЧастей[1], Число(МассивЧастей[2]), Текст);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьФорматированноеЗначениеПоляВвода(ИмяТаблицы, ИмяПоля, НомерСтроки, Текст)
	
	ТекущиеДанные = ЭтотОбъект[ИмяТаблицы][НомерСтроки];	 
	ОбменСГИСЭПД.УстановитьФорматированноеЗначениеПоляВвода(ЭтотОбъект, ТекущиеДанные, ИмяПоля, Текст);
	
КонецПроцедуры