
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

Функция СтруктураНастроекПоУмолчанию() Экспорт
	
	СтруктураНастроек = Новый Структура;
	СтруктураНастроек.Вставить("ОптимизироватьМаршрутВМаршрутномЛисте", Ложь);
	СтруктураНастроек.Вставить("ОткрыватьФормыДокументов", Ложь);
	
	Возврат СтруктураНастроек;
	
КонецФункции

Процедура РаспределитьЗаказыВМаршрутномЛисте(АдресВременногоХранилища, ПараметрыОптимизации) Экспорт
	
	уатЗащищенныеФункцииСервер_уэ.РаспределитьЗаказыВМаршрутномЛисте(
		АдресВременногоХранилища,
		ПараметрыОптимизации.ХарактеристикиСцепки.Грузоподъемность,
		ПараметрыОптимизации.ХарактеристикиСцепки.ОбъемКузова,
		ПараметрыОптимизации.ХарактеристикиСцепки.МаксимальноеКоличествоУпаковок,
		ПараметрыОптимизации.ХарактеристикиСцепки.ТипТС,
		ПараметрыОптимизации.ДанныеПоЗаказам.Заказы,
		ПараметрыОптимизации.мсвДопАдреса,
		ПараметрыОптимизации.ДанныеПоЗаказам.Гараж,
		ПараметрыОптимизации.ДанныеПоЗаказам.УчитыватьГаражВозвращения,
		ПараметрыОптимизации.ДанныеПоЗаказам.ДатаВыезда,
		ПараметрыОптимизации.НастройкиМаршрутизации.Оптимизация_НастройкаРежимОптимизации,
		ПараметрыОптимизации.НастройкиМаршрутизации.Оптимизация_НастройкаУчитыватьОкнаПоЗаказам
	);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли