
#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	Если Основная Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	уатПластиковыеКарты.Основная,
		|	уатПластиковыеКарты.КомуВыдана,
		|	уатПластиковыеКарты.КемВыдана,
		|	уатПластиковыеКарты.Ссылка
		|ИЗ
		|	Справочник.уатПластиковыеКарты КАК уатПластиковыеКарты
		|ГДЕ
		|	уатПластиковыеКарты.КомуВыдана = &КомуВыдана
		|	И уатПластиковыеКарты.Основная = ИСТИНА
		|	И уатПластиковыеКарты.Ссылка <> &Ссылка";
		
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		Запрос.УстановитьПараметр("КомуВыдана", КомуВыдана);
		
		ТЗ = Запрос.Выполнить().Выгрузить();
		Если ТЗ.Количество() > 0 Тогда
				СпрОбъект = ТЗ[0].Ссылка.ПолучитьОбъект();
				СпрОбъект.Основная = Ложь;
				СпрОбъект.Записать();
				ТекстНСТР = НСтр("en='Installed new main fuel card for ""%1"" (old main card: ""%2"")';ru='Установлена новая основная топливная карта для ""%1"" (старая основная карта: ""%2"")'");
				ТекстНСТР = СтрШаблон(ТекстНСТР, КомуВыдана, ТЗ[0].Ссылка);
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстНСТР);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти
