
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	уатЗащищенныеФункцииСервер.уатДокументФормаСпискаПриСозданииНаСервере(Отказ, СтандартнаяОбработка, ЭтотОбъект, ДопПараметрыОткрытие);
	Если Отказ тогда
		Возврат;
	КонецЕсли;
	
	Если Параметры.Свойство("Контрагент") Тогда
		ЭлементОтбора =Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Задание.Контрагент");
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		ЭлементОтбора.ПравоеЗначение = Параметры.Контрагент;
		ЭлементОтбора.Использование = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	уатЗащищенныеФункцииКлиент.уатДокументФормаСпискаПриОткрытии(Отказ, ЭтотОбъект, ДопПараметрыОткрытие);
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

&НаКлиенте
Процедура СписокПослеУдаления(Элемент)
	ПЛ = Элементы.Список.ТекущиеДанные;
	мТекстВопроса1 = "";
	мТекстВопроса2 = "";
	Если ПоПЛВведеныДокументы(ПЛ, мТекстВопроса1, мТекстВопроса2) Тогда
		Если ЗначениеЗаполнено(мТекстВопроса1) Тогда
			ТекстНСТР = НСтр("en='For waybill %1 is entered!"
"When deleting document, information on %2"
"will be deleted. Continue?';ru='Для путевого листа введены %1!"
"При удалении документа информация по %2"
"будет удалена. Продолжить?'");
			ТекстНСТР = СтрШаблон(ТекстНСТР, мТекстВопроса1, мТекстВопроса2);
			
			ПоказатьВопрос(Новый ОписаниеОповещения("СписокПослеУдаленияЗавершение", ЭтотОбъект), ТекстНСТР, РежимДиалогаВопрос.ОКОтмена);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СписокПослеУдаленияЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
    
    мОтвет = РезультатВопроса;
    Если мОтвет <> КодВозвратаДиалога.ОК Тогда
        Отказ = Истина;
        Возврат;
    КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Функция ПоПЛВведеныДокументы(Ссылка, мТекстВопроса1, мТекстВопроса2)
	мТаблицаЗаправкиГСМ = уатОбщегоНазначения.уатПолучитьЗаправкиДляПЛ(Ссылка);
	мТаблицаСливыГСМ    = уатОбщегоНазначения.уатПолучитьСливыДляПЛ(Ссылка);
	мТаблицаСливыНаТС   = уатОбщегоНазначения.уатПолучитьСливыНаТСДляПЛ(Ссылка);
	мТаблицаТТД         = уатПутевыеЛисты.уатТТДДляПЛ(Ссылка);
	
	Попытка
		мТаблицаБилетныеЛисты = Вычислить("уатПолучитьБилетныеЛистыДляПЛ(Ссылка)");
	Исключение
		мТаблицаБилетныеЛисты = Новый ТаблицаЗначений;
	КонецПопытки;
	
	Попытка
		мТаблицаВыручка = Вычислить("уатПолучитьВыручкуДляПЛ(Ссылка)");
	Исключение
		мТаблицаВыручка = Новый ТаблицаЗначений;
	КонецПопытки;
	
	Если мТаблицаЗаправкиГСМ.Количество() > 0 Тогда
		мТекстВопроса1 = "заправки ГСМ";
		мТекстВопроса2 = "заправкам";
	КонецЕсли;
	
	Если мТаблицаСливыГСМ.Количество() > 0 Или мТаблицаСливыНаТС.Количество() > 0 Тогда
		мТекстВопроса1 = "сливы ГСМ";
		мТекстВопроса2 = "сливам";
	КонецЕсли;
	
	Если мТаблицаТТД.Количество() > 0 Тогда
		
		Если Не ЗначениеЗаполнено(мТекстВопроса1) Тогда
			мТекстВопроса1 = "ТТД";
			мТекстВопроса2 = "ТТД";
		Иначе	
			мТекстВопроса1 = СокрЛП(мТекстВопроса1) + " и ТТД";
			мТекстВопроса2 = СокрЛП(мТекстВопроса2) + " и ТТД";
		КонецЕсли;
	КонецЕсли;
	
	Если мТаблицаБилетныеЛисты.Количество() > 0 Тогда
		
		Если Не ЗначениеЗаполнено(мТекстВопроса1) Тогда
			мТекстВопроса1 = "билетно-учетные листы";
			мТекстВопроса2 = "билетно-учетные листам";
		Иначе	
			мТекстВопроса1 = СокрЛП(мТекстВопроса1) + " и билетно-учетные листы";
			мТекстВопроса2 = СокрЛП(мТекстВопроса2) + " и билетно-учетным листам";
		КонецЕсли;
	КонецЕсли;
	
	Если мТаблицаВыручка.Количество() > 0 Тогда
		
		Если Не ЗначениеЗаполнено(мТекстВопроса1) Тогда
			мТекстВопроса1 = "выручка";
			мТекстВопроса2 = "выручку";
		Иначе	
			мТекстВопроса1 = СокрЛП(мТекстВопроса1) + " и выручка";
			мТекстВопроса2 = СокрЛП(мТекстВопроса2) + " и выручку";
		КонецЕсли;
	КонецЕсли;
	
	Возврат НЕ ПустаяСтрока(мТекстВопроса1);
КонецФункции

#КонецОбласти
