
#Область СлужебныеПроцедурыИФункции

Функция СписокДоступныхВидовОбластиДействия(ВидНачисления, РасчетПоСтрокам, Применение) Экспорт
	Рез = Новый СписокЗначений;
	
	Рез.Добавить(Перечисления.уатВидыОбластейДействияТарифовТС.Тягач, НСтр("en='Vehicle';ru='ТС / Прицеп'"));
	Рез.Добавить(Перечисления.уатВидыОбластейДействияТарифовТС.МодельТягача, НСтр("en='Vehicle model';ru='Модель ТС / прицепа'"));
	Рез.Добавить(Перечисления.уатВидыОбластейДействияТарифовТС.ТипТягача, НСтр("en='Vehicle type';ru='Тип ТС / прицепа'"));
	
	Если ВидНачисления = ПланыВидовРасчета.уатОсновныеНачисления.ОплатаЗаРемонт Тогда
		Рез.Добавить(Перечисления.уатВидыОбластейДействияТарифовТС.ВидРемонта);
		
	ИначеЕсли ВидНачисления.СпособРасчетаОплатыТруда = Перечисления.уатСпособыРасчетаОплатыТруда.ПроцентомОтВыручки Тогда
		Рез.Добавить(Перечисления.уатВидыОбластейДействияТарифовТС.Маршрут);
		Рез.Добавить(Перечисления.уатВидыОбластейДействияТарифовТС.Контрагент);
		
		Если НЕ уатОбщегоНазначенияПовтИсп.ВариантПоставкиСТД() Тогда
			Рез.Добавить(Перечисления.уатВидыОбластейДействияТарифовТС.ОбъектСтроительства);
			Рез.Добавить(Перечисления.уатВидыОбластейДействияТарифовТС.ВидПеревозки);
			Рез.Добавить(Перечисления.уатВидыОбластейДействияТарифовТС.НаправлениеПеревозки);
		КонецЕсли;
		
	ИначеЕсли РасчетПоСтрокам ИЛИ Применение = 1 Тогда
		Рез.Добавить(Перечисления.уатВидыОбластейДействияТарифовТС.Маршрут);
		Рез.Добавить(Перечисления.уатВидыОбластейДействияТарифовТС.Контрагент);
		Рез.Добавить(Перечисления.уатВидыОбластейДействияТарифовТС.Подразделение);
		
		Если НЕ уатОбщегоНазначенияПовтИсп.ВариантПоставкиСТД() Тогда
			Рез.Добавить(Перечисления.уатВидыОбластейДействияТарифовТС.ОбъектСтроительства);
			Рез.Добавить(Перечисления.уатВидыОбластейДействияТарифовТС.ВидПеревозки);
			Рез.Добавить(Перечисления.уатВидыОбластейДействияТарифовТС.НаправлениеПеревозки);
		КонецЕсли;
		
		Рез.Добавить(Перечисления.уатВидыОбластейДействияТарифовТС.ПунктОтправления);
		Рез.Добавить(Перечисления.уатВидыОбластейДействияТарифовТС.ПунктНазначения);
		Рез.Добавить(Перечисления.уатВидыОбластейДействияТарифовТС.Номенклатура);
		
		Если НЕ уатОбщегоНазначенияПовтИсп.ВариантПоставкиСТД() Тогда
			Рез.Добавить(Перечисления.уатВидыОбластейДействияТарифовТС.ГеозонаОтправления);
			Рез.Добавить(Перечисления.уатВидыОбластейДействияТарифовТС.ГеозонаНазначения);
			Рез.Добавить(Перечисления.уатВидыОбластейДействияТарифовТС.ВидГруза);
			Рез.Добавить(Перечисления.уатВидыОбластейДействияТарифовТС.ГрузовоеМесто);
		КонецЕсли;
		
	КонецЕсли;
	
	Рез.Добавить(Перечисления.уатВидыОбластейДействияТарифовТС.КлассВодителя);
	
	Возврат Рез;
КонецФункции

#КонецОбласти
