
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	уатЗащищенныеФункцииСервер.уатСправочникФормаСпискаПриСозданииНаСервере(Отказ, СтандартнаяОбработка, ДопПараметрыОткрытие);
	Если Отказ тогда
		Возврат;
	КонецЕсли;
	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
    ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
    // Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	уатЗащищенныеФункцииКлиент.уатСправочникФормаСпискаПриОткрытии(Отказ, ДопПараметрыОткрытие);
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы_Список

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	Если Элементы.Список.ТекущаяСтрока <> Неопределено Тогда
		уатОбщегоНазначенияКлиент.УстановитьОтборУСписка(Автоработы.Отбор, Новый ПолеКомпоновкиДанных("Работа"), 
			Элементы.Список.ТекущаяСтрока, ВидСравненияКомпоновкиДанных.Равно);
		уатОбщегоНазначенияКлиент.УстановитьОтборУСписка(Нормочасы.Отбор, Новый ПолеКомпоновкиДанных("Работа"), 
			Элементы.Список.ТекущаяСтрока, ВидСравненияКомпоновкиДанных.Равно);
	КонецЕсли;	
КонецПроцедуры

#КонецОбласти
