#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Выполняет заполнение предопределенных элементов справочника
//
Процедура ЗаполнитьПредопределенныеДанные() Экспорт
	Макет = Справочники.уатШаблоныЗаполненияПоУслугам.ПолучитьМакет("НастройкиПредопределенныхЭлементов");
	ОбластьНастроек = Макет.ПолучитьОбласть("Строки|Колонки");
	
	Для НомерСтроки = 1 По ОбластьНастроек.ВысотаТаблицы Цикл
		ИмяПредопрЭлемента = ОбластьНастроек.Область(НомерСтроки, 1, НомерСтроки, 1).Текст;
		
		Попытка
			ТекЭлемент = Справочники.уатШаблоныЗаполненияПоУслугам[ИмяПредопрЭлемента];
		Исключение
			Продолжить;
		КонецПопытки;
		
		СпрОбъект = ТекЭлемент.ПолучитьОбъект();
		
		СпрОбъект.ПолучательУслуг                        = Перечисления.уатПолучателиУслуг[ОбластьНастроек.Область(НомерСтроки, 2, НомерСтроки, 2).Текст];
		СпрОбъект.РежимЗаполнения                        = Число(ОбластьНастроек.Область(НомерСтроки, 3, НомерСтроки, 3).Текст);
		СпрОбъект.СворачиватьПоПолямДетализации          = Число(ОбластьНастроек.Область(НомерСтроки, 4, НомерСтроки, 4).Текст);
		СпрОбъект.ИспользоватьДанныеТТД                  = Число(ОбластьНастроек.Область(НомерСтроки, 5, НомерСтроки, 5).Текст);
		СпрОбъект.ИспользоватьДанныеЗаказНаТС            = Число(ОбластьНастроек.Область(НомерСтроки, 6, НомерСтроки, 6).Текст);
		Если НЕ уатОбщегоНазначенияПовтИсп.ВариантПоставкиСТД() Тогда
			СпрОбъект.ИспользоватьДанныеЗаказПеревозчику = Число(ОбластьНастроек.Область(НомерСтроки, 7, НомерСтроки, 7).Текст);
			СпрОбъект.ИспользоватьДанныеМаршрутныйЛист   = Число(ОбластьНастроек.Область(НомерСтроки, 8, НомерСтроки, 8).Текст);
		КонецЕсли;
		СпрОбъект.ИспользоватьДанныеКорректировкаЗаписей = Число(ОбластьНастроек.Область(НомерСтроки, 9, НомерСтроки, 9).Текст);
		СпрОбъект.СортировкаЗаказов                      = Число(ОбластьНастроек.Область(НомерСтроки, 10, НомерСтроки, 10).Текст);
		СпрОбъект.ИспользоватьДанныеРекламаций           = Число(ОбластьНастроек.Область(НомерСтроки, 10, НомерСтроки, 11).Текст);
		
		СпрОбъект.Записать();
	КонецЦикла;
КонецПроцедуры

#КонецОбласти

#КонецЕсли
