
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)	
	
	уатЗащищенныеФункцииСервер.уатСправочникФормаЭлементаПриСозданииНаСервере(Отказ, СтандартнаяОбработка, Объект, ЭтотОбъект, ДопПараметрыОткрытие);
	Если Отказ тогда
		Возврат;
	КонецЕсли;

	ТекущийЦвет = РеквизитФормыВЗначение("Объект").ЦветВидаОбслуживания.Получить();
	ЦветВидаОбслуживания = ТекущийЦвет;	
	
	Элементы.ВидОбслуживанияТС.СписокВыбора.Очистить();
	Элементы.ВидОбслуживанияТС.СписокВыбора.Добавить(
		ПредопределенноеЗначение("Перечисление.уатВидыОбслуживания.ТекущийРемонт")    , НСтр("en='Running repair';ru='Текущий ремонт'"));
	Элементы.ВидОбслуживанияТС.СписокВыбора.Добавить(
		ПредопределенноеЗначение("Перечисление.уатВидыОбслуживания.Техобслуживание")  , НСтр("ru='Техобслуживание'"));
	Элементы.ВидОбслуживанияТС.СписокВыбора.Добавить(
		ПредопределенноеЗначение("Перечисление.уатВидыОбслуживания.СреднийРемонт")    , НСтр("en='Medium repair';ru='Средний ремонт'"));
	Элементы.ВидОбслуживанияТС.СписокВыбора.Добавить(
		ПредопределенноеЗначение("Перечисление.уатВидыОбслуживания.КапитальныйРемонт"), НСтр("en='Overhaul';ru='Капитальный ремонт'"));
	Элементы.ВидОбслуживанияТС.СписокВыбора.Добавить(
		ПредопределенноеЗначение("Перечисление.уатВидыОбслуживания.Дооборудование")   , НСтр("en='AdditionalEquipment';ru='Дооборудование'"));
	Элементы.ВидОбслуживанияТС.СписокВыбора.Добавить(
		ПредопределенноеЗначение("Перечисление.уатВидыОбслуживания.Модернизация")     , НСтр("en='Renovation';ru='Модернизация'"));

	Элементы.ДоступенДляВыбораВМобильномПриложении.Видимость = НЕ уатОбщегоНазначенияПовтИсп.ВариантПоставкиСТД();

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	уатЗащищенныеФункцииКлиент.уатСправочникФормаЭлементаПриОткрытии(Отказ, ДопПараметрыОткрытие);
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	ТекущийОбъект.ЦветВидаОбслуживания = Новый ХранилищеЗначения(ЦветВидаОбслуживания,Новый СжатиеДанных(9));
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	ТекущийЦвет = ТекущийОбъект.ЦветВидаОбслуживания.Получить();
	ЦветВидаОбслуживания = ТекущийЦвет;
КонецПроцедуры

#КонецОбласти

