#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// СтандартныеПодсистемы.ВерсионированиеОбъектов

// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
//  Настройки - Структура - настройки подсистемы.
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт
	
	Настройки.ПриПолученииСлужебныхРеквизитов = Ложь;
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

// Выполняет заполнение предопределенных элементов справочника
//
Процедура ЗаполнитьПредопределенныеДанные() Экспорт
	
	СпрОбъект = Справочники.уатСтатусы_уэ.Новый.ПолучитьОбъект();
	СпрОбъект.ДействуетНаСопроводительныеДокументы = Истина;
	СпрОбъект.ВидВладельца = Перечисления.уатВидыВладельцевСопроводительныхДокументов.ОбщиеДокументы;
	СпрОбъект.Записать();
	
	СпрОбъект = Справочники.уатСтатусы_уэ.ОбработкаЗавершена.ПолучитьОбъект();
	СпрОбъект.ДействуетНаСопроводительныеДокументы = Истина;
	СпрОбъект.ВидВладельца = Перечисления.уатВидыВладельцевСопроводительныхДокументов.ОбщиеДокументы;
	СпрОбъект.Записать();
	
	СпрОбъект = Справочники.уатСтатусы_уэ.Пройдено.ПолучитьОбъект();
	СпрОбъект.ДействуетНаЖурналыТранспортныхДокументов = Истина;
	СпрОбъект.Записать();
	
	СпрОбъект = Справочники.уатСтатусы_уэ.НеПройдено.ПолучитьОбъект();
	СпрОбъект.ДействуетНаЖурналыТранспортныхДокументов = Истина;
	СпрОбъект.Записать();
	
	СпрОбъект = Справочники.уатСтатусы_уэ.Аннулировано.ПолучитьОбъект();
	СпрОбъект.ДействуетНаЖурналыТранспортныхДокументов = Истина;
	СпрОбъект.Записать();
	
	СпрОбъект = Справочники.уатСтатусы_уэ.Новый.ПолучитьОбъект();
	СпрОбъект.ДействуетНаЖурналыТранспортныхДокументов = Истина;
	СпрОбъект.Записать();
	
	СпрОбъект = Справочники.уатСтатусы_уэ.РазмещениеВКонтейнере.ПолучитьОбъект();
	СпрОбъект.ДействуетНаЗаказыГрузоотправителей = Истина;
	СпрОбъект.ЦветФонаПоУмолчанию   = Новый ХранилищеЗначения(Новый Цвет(191, 220, 40), Новый СжатиеДанных(9));
	СпрОбъект.Записать();
	
	СпрОбъект = Справочники.уатСтатусы_уэ.ВыданСоСкладаКлиента.ПолучитьОбъект();
	СпрОбъект.ДействуетНаЗаказыГрузоотправителей = Истина;
	СпрОбъект.ЦветФонаПоУмолчанию   = Новый ХранилищеЗначения(Новый Цвет(220, 40, 140), Новый СжатиеДанных(9));
	СпрОбъект.Записать();
	
	СпрОбъект = Справочники.уатСтатусы_уэ.ПринятИзРейсаКлиентом.ПолучитьОбъект();
	СпрОбъект.ДействуетНаЗаказыГрузоотправителей = Истина;
	СпрОбъект.ЦветФонаПоУмолчанию   = Новый ХранилищеЗначения(Новый Цвет(70, 200, 70), Новый СжатиеДанных(9));
	СпрОбъект.Записать();
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли