
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("НастройкиВнешнийМаршрутизатор", НастройкиВнешнийМаршрутизатор);
	Параметры.Свойство("флRarusVRP", флRarusVRP);
	
	НастройкиМаршрутизации = уатЗащищенныеФункцииСервер_уэ.ПрочитатьНастройкиВнешнийМаршрутизатор(НастройкиВнешнийМаршрутизатор);
	
	ГаражШтрафЗаОкноФиксир      = НастройкиМаршрутизации.depotPenalty_outOfTime_fixed;
	ГаражШтрафЗаОкноМинута      = НастройкиМаршрутизации.depotPenalty_outOfTime_minute;
	ЗаказШтрафЗаНераспред       = НастройкиМаршрутизации.locationsPenalty_drop;
	ЗаказШтрафЗаОкноФиксир      = НастройкиМаршрутизации.locationsPenalty_outOfTime_fixed;
	ЗаказШтрафЗаОкноМинута      = НастройкиМаршрутизации.locationsPenalty_outOfTime_minute;
	СтоимостьСобствТСФиксир     = НастройкиМаршрутизации.vehiclesCompanyCost_fixed;
	СтоимостьСобствТСЗаЕздку    = НастройкиМаршрутизации.vehiclesCompanyCost_run;
	СтоимостьСобствТСЗаКм       = НастройкиМаршрутизации.vehiclesCompanyCost_km;
	СтоимостьСобствТСЗаЧас      = НастройкиМаршрутизации.vehiclesCompanyCost_hour;
	СтоимостьСобствТСЗаЗаказ    = НастройкиМаршрутизации.vehiclesCompanyCost_location;
	СтоимостьПривлеченТСФиксир  = НастройкиМаршрутизации.vehiclesExternalCost_fixed;
	СтоимостьПривлеченТСЗаЕздку = НастройкиМаршрутизации.vehiclesExternalCost_run;
	СтоимостьПривлеченТСЗаКм    = НастройкиМаршрутизации.vehiclesExternalCost_km;
	СтоимостьПривлеченТСЗаЧас   = НастройкиМаршрутизации.vehiclesExternalCost_hour;
	СтоимостьПривлеченТСЗаЗаказ = НастройкиМаршрутизации.vehiclesExternalCost_location;
	СтоимостьВиртуалТСФиксир    = НастройкиМаршрутизации.vehiclesVirtualCost_fixed;
	СтоимостьВиртуалТСЗаЕздку   = НастройкиМаршрутизации.vehiclesVirtualCost_run;
	СтоимостьВиртуалТСЗаКм      = НастройкиМаршрутизации.vehiclesVirtualCost_km;
	СтоимостьВиртуалТСЗаЧас     = НастройкиМаршрутизации.vehiclesVirtualCost_hour;
	СтоимостьВиртуалТСЗаЗаказ   = НастройкиМаршрутизации.vehiclesVirtualCost_location;
	
	ЗаказШтрафЗаОкноФиксирРанее   = НастройкиМаршрутизации.locationsPenalty_early_fixed;
	ЗаказШтрафЗаОкноМинутаРанее   = НастройкиМаршрутизации.locationsPenalty_early_minute;
	ЗаказШтрафЗаОкноФиксирПозднее = НастройкиМаршрутизации.locationsPenalty_late_fixed;
	ЗаказШтрафЗаОкноМинутаПозднее = НастройкиМаршрутизации.locationsPenalty_late_minute;

	СкладШтрафЗаКаждыйСлучайНарушения = НастройкиМаршрутизации.depotPenalty_throughput_fixed;
	СкладШтрафЗаКаждыйКГПревышения    = НастройкиМаршрутизации.depotPenalty_throughput_kg;
	СкладШтрафЗаКаждуюГрузовуюЕдиницу = НастройкиМаршрутизации.depotPenalty_throughput_unit;
	СкладШтрафЗаНарушениеКоличестваТС = НастройкиМаршрутизации.depotPenalty_throughput_vehicle;
	
	МультизаказШтрафЗаЛишнееПосещениеТочек = НастройкиМаршрутизации.multiordersPenalty_per_extra_visit;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьВидимостьДоступность();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СохранитьНастройкиШтрафов(Команда)
	
	НастройкиМаршрутизации = Новый Структура();
	
	НастройкиМаршрутизации.Вставить("depotPenalty_outOfTime_fixed",      ГаражШтрафЗаОкноФиксир);
	НастройкиМаршрутизации.Вставить("depotPenalty_outOfTime_minute",     ГаражШтрафЗаОкноМинута);
	НастройкиМаршрутизации.Вставить("locationsPenalty_drop",             ЗаказШтрафЗаНераспред);
	НастройкиМаршрутизации.Вставить("locationsPenalty_outOfTime_fixed",  ЗаказШтрафЗаОкноФиксир);
	НастройкиМаршрутизации.Вставить("locationsPenalty_outOfTime_minute", ЗаказШтрафЗаОкноМинута);
	НастройкиМаршрутизации.Вставить("vehiclesCompanyCost_fixed",         СтоимостьСобствТСФиксир);
	НастройкиМаршрутизации.Вставить("vehiclesCompanyCost_run",           СтоимостьСобствТСЗаЕздку);
	НастройкиМаршрутизации.Вставить("vehiclesCompanyCost_km",            СтоимостьСобствТСЗаКм);
	НастройкиМаршрутизации.Вставить("vehiclesCompanyCost_hour",          СтоимостьСобствТСЗаЧас);
	НастройкиМаршрутизации.Вставить("vehiclesCompanyCost_location",      СтоимостьСобствТСЗаЗаказ);
	НастройкиМаршрутизации.Вставить("vehiclesExternalCost_fixed",        СтоимостьПривлеченТСФиксир);
	НастройкиМаршрутизации.Вставить("vehiclesExternalCost_run",          СтоимостьПривлеченТСЗаЕздку);
	НастройкиМаршрутизации.Вставить("vehiclesExternalCost_km",           СтоимостьПривлеченТСЗаКм);
	НастройкиМаршрутизации.Вставить("vehiclesExternalCost_hour",         СтоимостьПривлеченТСЗаЧас);
	НастройкиМаршрутизации.Вставить("vehiclesExternalCost_location",     СтоимостьПривлеченТСЗаЗаказ);
	НастройкиМаршрутизации.Вставить("vehiclesVirtualCost_fixed",         СтоимостьВиртуалТСФиксир);
	НастройкиМаршрутизации.Вставить("vehiclesVirtualCost_run",           СтоимостьВиртуалТСЗаЕздку);
	НастройкиМаршрутизации.Вставить("vehiclesVirtualCost_km",            СтоимостьВиртуалТСЗаКм);
	НастройкиМаршрутизации.Вставить("vehiclesVirtualCost_hour",          СтоимостьВиртуалТСЗаЧас);
	НастройкиМаршрутизации.Вставить("vehiclesVirtualCost_location",      СтоимостьВиртуалТСЗаЗаказ);
	
	НастройкиМаршрутизации.Вставить("locationsPenalty_early_fixed",      ЗаказШтрафЗаОкноФиксирРанее);
	НастройкиМаршрутизации.Вставить("locationsPenalty_early_minute",     ЗаказШтрафЗаОкноМинутаРанее);
	НастройкиМаршрутизации.Вставить("locationsPenalty_late_fixed",       ЗаказШтрафЗаОкноФиксирПозднее);
	НастройкиМаршрутизации.Вставить("locationsPenalty_late_minute",      ЗаказШтрафЗаОкноМинутаПозднее);
	
	НастройкиМаршрутизации.Вставить("depotPenalty_throughput_fixed",     СкладШтрафЗаКаждыйСлучайНарушения);
	НастройкиМаршрутизации.Вставить("depotPenalty_throughput_kg",        СкладШтрафЗаКаждыйКГПревышения);
	НастройкиМаршрутизации.Вставить("depotPenalty_throughput_unit",      СкладШтрафЗаКаждуюГрузовуюЕдиницу);
	НастройкиМаршрутизации.Вставить("depotPenalty_throughput_vehicle",   СкладШтрафЗаНарушениеКоличестваТС);
	
	НастройкиМаршрутизации.Вставить("multiordersPenalty_per_extra_visit", МультизаказШтрафЗаЛишнееПосещениеТочек);
	
	уатЗащищенныеФункцииСервер_уэ.ЗаписатьНастройкиВнешнийМаршрутизатор(НастройкиВнешнийМаршрутизатор, НастройкиМаршрутизации);
	
	Закрыть(Новый Структура("НастройкиВнешнийМаршрутизатор", НастройкиВнешнийМаршрутизатор));
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьНастройкиПоУмолчанию(Команда)
	
	ПоказатьВопрос(
		Новый ОписаниеОповещения("УстановитьНастройкиПоУмолчаниюОтвет", ЭтотОбъект),
		НСтр("ru = 'Установить значения всех настроек по-умолчанию?'"),
		РежимДиалогаВопрос.ДаНет
	);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура УстановитьНастройкиПоУмолчаниюОтвет(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если Не РезультатВопроса = КодВозвратаДиалога.Да Тогда 
		Возврат;
	КонецЕсли;
	
	УстановитьНастройкиПоУмолчаниюСервер();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьНастройкиПоУмолчаниюСервер()
	
	МодульВнешнейМаршрутизации = ОбщегоНазначения.ОбщийМодуль("уатВнешнийМаршрутизаторСервер_уэ");
	НастройкиМаршрутизации = МодульВнешнейМаршрутизации.ПолучитьСтруктуруНастроек();
	
	ГаражШтрафЗаОкноФиксир      = НастройкиМаршрутизации.depotPenalty_outOfTime_fixed;
	ГаражШтрафЗаОкноМинута      = НастройкиМаршрутизации.depotPenalty_outOfTime_minute;
	ЗаказШтрафЗаНераспред       = НастройкиМаршрутизации.locationsPenalty_drop;
	ЗаказШтрафЗаОкноФиксир      = НастройкиМаршрутизации.locationsPenalty_outOfTime_fixed;
	ЗаказШтрафЗаОкноМинута      = НастройкиМаршрутизации.locationsPenalty_outOfTime_minute;
	
	ЗаказШтрафЗаОкноФиксирРанее   = НастройкиМаршрутизации.locationsPenalty_early_fixed;
	ЗаказШтрафЗаОкноМинутаРанее   = НастройкиМаршрутизации.locationsPenalty_early_minute;
	ЗаказШтрафЗаОкноФиксирПозднее = НастройкиМаршрутизации.locationsPenalty_late_fixed;
	ЗаказШтрафЗаОкноМинутаПозднее = НастройкиМаршрутизации.locationsPenalty_late_minute;
	
	СтоимостьСобствТСФиксир     = НастройкиМаршрутизации.vehiclesCompanyCost_fixed;
	СтоимостьСобствТСЗаЕздку    = НастройкиМаршрутизации.vehiclesCompanyCost_run;
	СтоимостьСобствТСЗаКм       = НастройкиМаршрутизации.vehiclesCompanyCost_km;
	СтоимостьСобствТСЗаЧас      = НастройкиМаршрутизации.vehiclesCompanyCost_hour;
	СтоимостьСобствТСЗаЗаказ    = НастройкиМаршрутизации.vehiclesCompanyCost_location;
	СтоимостьПривлеченТСФиксир  = НастройкиМаршрутизации.vehiclesExternalCost_fixed;
	СтоимостьПривлеченТСЗаЕздку = НастройкиМаршрутизации.vehiclesExternalCost_run;
	СтоимостьПривлеченТСЗаКм    = НастройкиМаршрутизации.vehiclesExternalCost_km;
	СтоимостьПривлеченТСЗаЧас   = НастройкиМаршрутизации.vehiclesExternalCost_hour;
	СтоимостьПривлеченТСЗаЗаказ = НастройкиМаршрутизации.vehiclesExternalCost_location;
	СтоимостьВиртуалТСФиксир    = НастройкиМаршрутизации.vehiclesVirtualCost_fixed;
	СтоимостьВиртуалТСЗаЕздку   = НастройкиМаршрутизации.vehiclesVirtualCost_run;
	СтоимостьВиртуалТСЗаКм      = НастройкиМаршрутизации.vehiclesVirtualCost_km;
	СтоимостьВиртуалТСЗаЧас     = НастройкиМаршрутизации.vehiclesVirtualCost_hour;
	СтоимостьВиртуалТСЗаЗаказ   = НастройкиМаршрутизации.vehiclesVirtualCost_location;
	
	СкладШтрафЗаКаждыйСлучайНарушения = НастройкиМаршрутизации.depotPenalty_throughput_fixed;
	СкладШтрафЗаКаждыйКГПревышения    = НастройкиМаршрутизации.depotPenalty_throughput_kg;
	СкладШтрафЗаКаждуюГрузовуюЕдиницу = НастройкиМаршрутизации.depotPenalty_throughput_unit;
	СкладШтрафЗаНарушениеКоличестваТС = НастройкиМаршрутизации.depotPenalty_throughput_vehicle;
	
	МультизаказШтрафЗаЛишнееПосещениеТочек = НастройкиМаршрутизации.multiordersPenalty_per_extra_visit;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимостьДоступность()
	Элементы.ГруппаГаражШтраф.Видимость             = Не флRarusVRP;
	Элементы.ГруппаЗаказШтраф.Видимость             = Не флRarusVRP;
	Элементы.ГруппаШтрафЗаПозднееПрибытие.Видимость = Не флRarusVRP;
	Элементы.ГруппаШтрафЗаРаннееПрибытие.Видимость  = Не флRarusVRP;
	
	Элементы.СтоимостьВиртуалТСЗаЕзку.Видимость     = Не флRarusVRP;
	Элементы.СтоимостьПривлеченТСЗаЕзку.Видимость   = Не флRarusVRP;
	Элементы.СтоимостьСобствТСЗаЕздку.Видимость     = Не флRarusVRP;
КонецПроцедуры

#КонецОбласти
