#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Возвращает адрес технической поддержки для отправки сообщения
//
// Возвращаемое значение:
//   Структура
//
Функция АдресТехподдержки() Экспорт
	
	СтруктураАдреса = Новый Структура;
	СтруктураАдреса.Вставить("Адрес", "auto@rarus.ru");
	СтруктураАдреса.Вставить("Представление", "Служба поддержки 1С-Рарус. Транспорт, логистика");
	Кому = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(СтруктураАдреса);
	Возврат Кому;
	
КонецФункции

// Возвращает адрес технической поддержки сервиса маршрутизации для отправки сообщения
//
// Возвращаемое значение:
//   Структура
//
Функция АдресТехподдержкиМаршрутизацииRarusVRP() Экспорт
	
	СтруктураАдреса = Новый Структура;
	СтруктураАдреса.Вставить("Адрес", "vrp@rarus.ru");
	СтруктураАдреса.Вставить("Представление", "Маршрутизация 1С-Рарус");
	Кому = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(СтруктураАдреса);
	Возврат Кому;
	
КонецФункции

#КонецОбласти

#КонецЕсли