
#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если СоздаватьЗаправкиГСМ
		ИЛИ СоздаватьСливыГСМ Тогда
		ПроверяемыеРеквизиты.Добавить("ПрофильОбмена");
		ПроверяемыеРеквизиты.Добавить("Организация");
		ПроверяемыеРеквизиты.Добавить("Ответственный");
		
		Если СоздаватьЗаправкиГСМ Тогда 
			ПроверяемыеРеквизиты.Добавить("АЗС");
			ПроверяемыеРеквизиты.Добавить("ВидЗаправки");
		КонецЕсли;  
		Если СоздаватьСливыГСМ Тогда    
			ПроверяемыеРеквизиты.Добавить("АЗССлив");
			ПроверяемыеРеквизиты.Добавить("ВидСлива");
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти