
#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	Обработчик = Новый ОписаниеОповещения("ЗагрузитьШтрафыЗавершение", ЭтотОбъект, ПараметрыВыполненияКоманды.Источник);
	ПараметрыОткрытияФормы = Новый Структура();
	ПараметрыОткрытияФормы.Вставить("Заголовок", Нстр("ru = 'Выберите учетную запись'"));
	ПараметрыОткрытияФормы.Вставить("Отбор", Новый Структура("ВнешняяСистема,ЗагрузкаПроездовПоЦКАДвОтчетыСистемыАвтодор",
		ПредопределенноеЗначение("Справочник.уатВнешниеСистемы.ШтрафовНет"), Истина));
	ОткрытьФорму("Справочник.уатУчетныеЗаписиСервисовШтрафов.ФормаВыбора", ПараметрыОткрытияФормы, ПараметрыВыполненияКоманды.Источник,,,,Обработчик);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ЗагрузитьШтрафыЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Загружено   = 0;
	ЗагрузитьШтрафыЗавершениеСервер(Результат, Загружено, ДополнительныеПараметры);

КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьШтрафыЗавершениеСервер(Результат, Загружено = 0, ФормаВладелец)
	
	ТекстОшибки = "";

	ДлительнаяОперация = ЗагрузитьШтрафыЗавершениеДлительнаяОперацияСервер(Результат, ТекстОшибки);
	
	НастройкиОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ФормаВладелец);
	НастройкиОжидания.ВыводитьОкноОжидания       = Истина;
	НастройкиОжидания.ВыводитьПрогрессВыполнения = Истина;
	
	Обработчик = Новый ОписаниеОповещения("ЗагрузитьШтрафыЗавершениеДлительнаяОперацияЗавершение", ЭтотОбъект);
	
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, Обработчик, НастройкиОжидания);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьШтрафыЗавершениеДлительнаяОперацияЗавершение(Операция, ДополнительныеПараметры) Экспорт
	
	Если Операция = Неопределено Тогда
		
	Иначе
		Если Операция.Статус = "Выполнено" Тогда
			Если ЭтоАдресВременногоХранилища(Операция.АдресРезультата) Тогда
				Данные = ПолучитьИзВременногоХранилища(Операция.АдресРезультата);
				Если ТипЗнч(Данные) = Тип("Структура") Тогда
					Если Данные.Свойство("ТекстОшибки") Тогда
						Если ЗначениеЗаполнено(Данные.ТекстОшибки) Тогда
							ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Данные.ТекстОшибки);
							Возврат;
						Иначе
							ОповеститьОбИзменении(Тип("ДокументСсылка.уатОтчетСистемыАвтодор"));
						КонецЕсли;
					КонецЕсли;
					
				КонецЕсли;
			КонецЕсли;
		Иначе
			ВызватьИсключение Операция.КраткоеПредставлениеОшибки;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ЗагрузитьШтрафыЗавершениеДлительнаяОперацияСервер(УчетнаяЗапись, ТекстОшибки)
	
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(Новый УникальныйИдентификатор);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НСтр("ru = 'Загрузка информации о проездах по ЦКАД'");
	ПараметрыВыполнения.ЗапуститьВФоне = Истина;

	Возврат ДлительныеОперации.ВыполнитьВФоне(
	"уатИнтеграции_проф.ШтрафовНет_СписокШтрафовДлительнаяОперация",
	Новый Структура("УчетнаяЗапись, ЗагрузкаПроездовПоЦКАДвОтчетыСистемыАвтодор",
		УчетнаяЗапись, Истина),
	ПараметрыВыполнения);
	
КонецФункции

#КонецОбласти