

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// СтандартныеПодсистемы.ВерсионированиеОбъектов

// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
//  Настройки - Структура - настройки подсистемы.
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт
	
	Настройки.ПриПолученииСлужебныхРеквизитов = Ложь;
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов


#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Функция ПолучитьПробегШины(Шина,Знач Дата = Неопределено) Экспорт

	Если НЕ ЗначениеЗаполнено(Дата) тогда
		Дата = КонецДня(ТекущаяДата());
	КонецЕсли;
	
	мЗапрос = Новый Запрос;
	мЗапрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	уатИзносПробегШинОбороты.СерияНоменклатуры,
	|	уатИзносПробегШинОбороты.ПробегОборот
	|ИЗ
	|	РегистрНакопления.уатИзносПробегШин.Обороты(, &ДатаКон, , СерияНоменклатуры = &СерияНоменклатуры) КАК уатИзносПробегШинОбороты";
	мЗапрос.УстановитьПараметр("ДатаКон"          , Дата);
	мЗапрос.УстановитьПараметр("СерияНоменклатуры", Шина);
	
	Выборка = мЗапрос.Выполнить().Выбрать();
	Если Выборка.Следующий()Тогда
		Возврат Выборка.ПробегОборот;
	Иначе
		Возврат 0;
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#КонецЕсли
