#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("Массив")  Тогда
		Если Параметры.Массив <> Неопределено Тогда
			Для Каждого ТекСтрока Из Параметры.Массив Цикл
				НайденныеСтроки = ВыработкаАгрегатов.НайтиСтроки(Новый Структура("Агрегат, ПараметрВыработки, ТС", ТекСтрока.Агрегат, ТекСтрока.ПараметрВыработки, ТекСтрока.ТС));
				Если НайденныеСтроки.Количество() = 0 Тогда
					НоваяСтрока = ВыработкаАгрегатов.Добавить();
					НоваяСтрока.ТС = ТекСтрока.ТС;
					НоваяСтрока.Агрегат = ТекСтрока.Агрегат;
					НоваяСтрока.ПараметрВыработки = ТекСтрока.ПараметрВыработки;
					НоваяСтрока.Количество = ТекСтрока.Количество;
				КонецЕсли;
			КонецЦикла;
			Если ВыработкаАгрегатов.Количество() = 0 Тогда
				Отказ = Истина;
				ТекстНСТР = НСтр("en='No output on car parts, installed on vehicle!';ru='Нет выработки по агрегатам, установленным на ТС!'");
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстНСТР);
			КонецЕсли;
		Иначе
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти