
#Область ОбработчикиСобытий

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ДанныеВыбора = Новый СписокЗначений();
	ДанныеВыбора.Добавить(Перечисления.уатРазделыПланирования.Выработка);
	ДанныеВыбора.Добавить(Перечисления.уатРазделыПланирования.ПредоставленныеУслуги);
	ДанныеВыбора.Добавить(Перечисления.уатРазделыПланирования.ДоходыРасходы);
	Если ПолучитьФункциональнуюОпцию("уатИспользоватьЗакреплениеМаршрутныхЛистовЗаПеревозчиками_уэ") Тогда
		ДанныеВыбора.Добавить(Перечисления.уатРазделыПланирования.ОбъемыПеревозок);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
